Repository: xiangzhai/vjasssdk
Catalog: vjassdoc/locale/*/LC_MESSAGES/vjassdoc.po
Languages: de

source: Description
de: Beschreibung

source: Source File
de: Quell-Datei

source: Function
de: Funktion

source: Hook Function
de: Hakenfunktion

source: UNIX mode has been detected.
de: UNIX-Modus wurde ermittelt.

source: Win32 mode has been detected.
de: Win32-Modus wurde ermittelt.

source: You've selected one or several databases.
de: Sie haben eine oder mehrere Datenbanken ausgewählt.

source: Duration: %f seconds CPU duration: %f seconds
de: Dauer: %f Sekunden CPU-Dauer: %f Sekunden

source: Finished (%d lines, %d files).
de: Fertig (%d Zeilen, %d Dateien).

source: Function Interface
de: Funktionsschnittstelle

source: Type
de: Typ

source: Container
de: Behältnis

source: Static
de: Statisch

source: Default Return Value
de: Standard-Rückgabewert

source: Comments
de: Kommentare

source: Keywords
de: Schlüsselwörter

source: Keys
de: Schlüssel

source: Text Macros
de: Textmakros

source: Text Macro Instances
de: Textmakro-Instanzen

source: Types
de: Typen

source: Locals
de: Lokale

source: Globals
de: Globale

source: Members
de: Elemente

source: Parameters
de: Parameter

source: Function Interfaces
de: Funktionsschnittstellen

source: Functions
de: Funktionen

source: Methods
de: Methoden

source: Calls
de: Aufrufe

source: Implementations
de: Implementationen

source: Hooks
de: Haken

source: Interfaces
de: Schnittstellen

source: Structs
de: Strukturen

source: Modules
de: Module

source: Scopes
de: Bezugsrahmen

source: Libraries
de: Bibliotheken

source: Source Files
de: Quell-Dateien

source: Documentation Comments
de: Dokumentationskommentare

source: Adding default Jass types.
de: Füge Standard-Jass-Typen hinzu.

source: Was unable to create file "inheritancelist.html".
de: Datei "inheritancelist.html" konnte nicht erzeugt werden.

source: Inheritance List
de: Vererbungsliste

source: Return to start page
de: Zurück zur Startseite

source: Was unable to create file "requirementlist.html".
de: Datei "requirementlist.html" konnte nicht erzeugt werden.

source: Requirement List
de: Anforderungsliste

source: %d syntax errors.
de: %d Syntaxfehler.

source: File %s, line %d: %s
de: Datei %s, Zeile %d: %s

source: Sorting alphabetically.
de: Alphabetisch sortieren.

source: Creating HTML files.
de: Erzeuge HTML-Dateien.

source: Was unable to create file "index.html".
de: Datei "index.html" konnte nicht erzeugt werden.

source: Generated by vjassdoc %s.
de: Von vjassdoc %s erzeugt.

source: Undocumented Objects
de: Nicht dokumentierte Objekte

source: Error while creating file "%s".
de: Fehler während der Erzeugung der Datei "%s".

source: en
de: de

source: Initializing parsed objects.
de: Initialisiere geparste Objekte.

source: Creating database. Using SQLite version %s.
de: Erzeuge Datenbank. Verwende SQLite-Version %s.

source: Database "%s" does already exist. Do you want to replace it by the newer one?
de: Datenbank "%s" existiert bereits. Soll sie durch die neuere ersetzt werden?

source: Answer possiblities: y, yes, n, no.
de: Antwortmöglichkeiten: j, ja, n, nein.

source: y
de: j

source: yes
de: ja

source: Was unable to replace old database.
de: Alte Datenbank konnte nicht ersetzt werden.

source: no
de: nein

source: Canceled database creation.
de: Datenbankerzeugung abgebrochen.

source: Unknown answer.
de: Unbekannte Antwort.

source: Was unable to begin transaction. State: %d. Message: %s
de: Transaktion konnte nicht gestartet werden. Status: %d. Nachricht: %s

source: Was unable to create table "%s" from list %d. State: %d. Message: %s
de: Tabelle "%s" der Liste %d konnte nicht angelegt werden. Status %d. Nachricht %s

source: Was unable to insert id of list %d into table "%s". State: %d. Message: %s
de: Status: %d. Nachricht: %s

source: Was unable to run execution "%s" of table "%s" from list %d. State: %d. Message: %s
de: Eine Ausführung der Tablle "%s" aus der Liste %d konnte nicht ausgeführt werden. Status: %d. Nachricht: %s

source: Was unable to commit. State: %d. Message: %s
de: Konnte nicht übergeben werden. Status: %d. Nachricht: %s

source: Was unable to create database. State %d.
de: Datenbank konnte nicht erzeugt werden. Status %d.

source: Loading database %s.
de: Lade Datenbank %s.

source: Was unable to prepare SQL statement of table %s. State %d. Message: "%s".
de: Eine SQL-Anweisung der Tabelle %s konnte nicht vorbereitet werden. Status %d.

source: SQL statement of table %s is NULL.
de: SQL-Anweisung der Tabelle %s ist NULL.

source: SQL database entry of table %s in row %d and column %d is NULL.
de: SQL-Datenbankeintrag der Tablle %s in Reihe %d und Spalte %d ist NULL.

source: Was unable to finalize prepared SQL statement of table %s. State %d.
de: Vorbereitete SQL-Anweisung der Tabelle %s konnte nicht abgearbeitet werden. Status %d.

source: Got %d database objects.
de: %d Datenbankobjekte erhalten.

source: Intializing database objects.
de: Initialisiere Datenbankobjekte.

source: Adding database objects.
de: Füge Datenbankobjekte hinzu.

source: Was unable to open database "%s". State %d.
de: Datenbank "%s" konnte nicht geöffnet werden. Status %d.

source: Removing database %d.
de: Entferne Datenbank %d.

source: Was unable to open file %s.
de: Datei %s konnte nicht geöffnet werden.

source: Parsed file %s successfully (number %d, %d lines).
de: Datei %s wurde erfolgreich durchlaufen (Nummer %d, %d Zeilen).

source: Unknown list %d.
de: Unbekannte Liste %d.

source: Error while opening or creating file "%s" for compilation process.
de: Fehler während des Öffnens oder der Erzeugung der Datei "%s" für den Kompilierungsprozess.

source: Opening or creating file "%s" for compilation process.
de: Öffne oder erzeuge Datei "%s" für den Kompilierungsprozess.

source: Writing globals.
de: Schreibe Globale.

source: Writing members.
de: Schreibe Elemente.

source: Writing function prototype globals.
de: Schreibe Funktionsprototypenglobale.

source: Writing method prototype globals.
de: Schreibe Methodenprototypenglobale.

source: Writing libraries.
de: Schreibe Bibliotheken.

source: Source file
de: Quell-Datei

source: Once
de: Einmal

source: Initializer
de: Initialisierer

source: Requirement
de: Anforderungen

source: Library
de: Bibliothek

source: Scope
de: Bezugsrahmen

source: Private
de: Privat

source: Reading line %d.
de: Lese Zeile %d.

source: Was unable to import file %s.
de: Datei %s konnte nicht importiert werden.

source: Importing file %s.
de: Importiere Datei %s.

source: Unknown preprocessor statement: "%s".
de: Unbekannte Präprozessoranweisung: "%s".

source: Missing preprocessor statement.
de: Präprozessoranweisung fehlt.

source: Missing type identifier.
de: Typbezeichner fehlt.

source: Unknown expression: "%s". Expected "extends".
de: Unbekannter Ausdruck: "%s". Erwartete "extends".

source: Missing "[" expression.
de: "["-Ausdruck fehlt.

source: Missing "]" expression.
de: "]"-Ausdruck fehlt.

source: Missing expression after "private" keyword.
de: Ausdruck nach "private"-Schlüsselwort fehlt.

source: Starting with not required space. Reason: %d.
de: Beginne mit nicht benötigtem Raum. Grund %d.

source: Empty line, ignoring line.
de: Leere Zeile, ignoriere Zeile.

source: Debug statement, ignoring line.
de: Debug-Anweisung, ignoriere Zeile.

source: Not required space. Reason: %d.
de: Nicht benötigter Raum. Grund %d.

source: Unknown expression: "%s".
de: Unbekannter Ausdruck: "%s".

source: Detected " character. Ignoring // and /// expressions.
de: "-Zeichen ermittelt. Ignoriere //- und ///-Ausdrücke.

source: Detected " character. Do not ignore // and /// expressions anymore.
de: "-Zeichen ermittelt. //- und ///-Ausdrücke werden nicht mehr ignoriert.

source: Detected empty comment.
de: Leerer Kommentar wurde gefunden.

source: Detected empty documentation comment.
de: Leerer Dokumentationskommentar wurde gefunden.

source: Ignoring function space.
de: Ignoriere Funktionsraum.

source: Ignoring method space.
de: Ignoriere Methodenraum.

source: Missing default return value expression.
de: Standard-Rückgabewert-Ausdruck fehlt.

source: Missing "(" character.
de: "("-Zeichen fehlt.

source: Missing ")" character.
de: ")"-Zeichen fehlt.

source: Ignoring text macro space.
de: Ignoriere Textmakroraum.

source: Public
de: Öffentlich

source: Native
de: Nativ

source: Constant
de: Konstant

source: Arguments
de: Argumente

source: Execution
de: Ausführung

source: Evaluation
de: Auswertung

source: Value
de: Wert

source: Size
de: Größe

source: Instances
de: Instanzen

source: Extensions
de: Erweiterungen

source: Child Structs
de: Kindstrukturen

source: Constructor
de: Konstruktor

source: Destructor
de: Destruktor

source: Inherited Members
de: Geerbte Elemente

source: Inherited Methods
de: Geerbte Methoden

source: Module
de: Modul

source: Undefined type "%s".
de: Undefinierter Typ "%s".

source: Return Type
de: Rückgabetyp

source: Delegate
de: Delegiert

source: Inherited Type
de: Geerbter Typ

source: Copyright © 2008, 2009 Tamino Dauth License GPLv2+: GNU GPL version 2 or later <http://gnu.org/licenses/gpl.html> This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
de: Copyright © 2008, 2009 Tamino Dauth Lizenz GPLv2+: GNU GPL Version 2 oder spätere <http://gnu.org/licenses/gpl.html> Dies ist freie Software: Sie dürfen sie verändern und neu verteilen. Es gibt vom Gesetz KEINERLEI GEWÄHRLEISTUNG für die zulässige Ausdehnung.

source: Usage: vjassdoc [Options] [Code files]
de: Verwendung: vjassdoc [Optionen] [Code-Dateien]

source: Options:
de: Optionen:

source: -V --version Shows the current version of vjassdoc.
de: -V --version Zeigt die gegenwärtige Version von vjassdoc an.

source: -h --help Shows this text.
de: -h --help Zeigt diesen Text an.

source: -j --jass vJass code will be ignored.
de: -j --jass vJass-Code wird ignoriert.

source: -d --debug Lines starting with the vJass keyword 'debug' won't be ignored.
de: -d --debug Zeilen, die mit dem vJass-Schlüsselwort "debug" beginnen, werden nicht ignoriert.

source: -p --private Private objects will be parsed.
de: -p --private Private Objekte werden geparst.

source: -m --textmacros Code between text macro statements will be parsed (Warning: There can be many parsing errors!).
de: -m --textmacros Der Code zwischen Textmakro-Anweisungen wird geparst (Achtung: Es kann viele Parsfehler geben!).

source: -f --functions Code between function/method statements will be parsed.
de: -f --functions Der Code zwischen function/method-Anweisungen wird geparst.

source: --no<object type name> Objects of type <object type name> won't added to the output files.
de: --no<Objekttypname> Objekte des Typs <Objekttypname> werden nicht zu den Ausgabedateien hinzugefügt.

source: The following object type names are available:
de: Die folgenden Objekttypnamen sind verfügbar:

source: calls
de: locals

source: -l --html Creates a simple HTML API documentation.
de: -l --html Erzeugt eine einfache HTML-API-Dokumentation.

source: -g --pages Creates an HTML file for each parsed object.
de: -g --pages Erzeugt für jedes geparste Objekt eine HTML-Datei.

source: -s --specialpages Creates additional HTML files containing more information about all parsed objects.
de: -s --specialpages Erzeugt zusätzliche HTML-Dateien, welche weitere Informationen über alle geparsten Objekte enthalten.

source: -x --syntax Checks syntax. Not implemented yet!
de: -x --syntax Überprüft die Syntax. Noch nicht implementiert!

source: -C --compile <arg> Uses file <arg> to create a map Jass script.
de: -C --compile <arg> Verwendet die Datei <arg>, um ein Jass-Kartenskript zu erzeugen.

source: -L --database <arg> Uses file <arg> to create an SQLite3 database which contains all parsed objects.
de: -L --database <arg> Benutzt Datei <arg>, um eine SQLite3-Datenbank zu erzeugen, welche alle geparsten Objekte enthält.

source: -v --verbose Shows more information about the process.
de: -v --verbose Zeigt mehr Informationen über den Prozess an.

source: -t --time Detects the elapsed time and shows it at the end of the process.
de: -t --time Ermittelt die vergangene Zeit und zeigt diese am Ende des Prozesses an.

source: -a --alphabetical All objects will be aranged in alphabetical order.
de: -a --alphabetical Alle Objekte werden in alphabetischer Reihenfolge sortiert.

source: -T --title <arg> <arg> has to be replaced by the title which is used for the API documentation.
de: -T --title <arg> <arg> muss durch den für die API-Dokumentation verwendeten Titel ersetzt werden.

source: -I --importdirs <args> <args> has to be replaced by one or more import directories (Used for the //! import macro in vJass).
de: -I --importdirs <args> <args> muss durch eines oder mehrere Import-Verzeichnisse ersetzt werden (wird für das //!-Import-Makro aus vJass verwendet).

source: -D --dir <arg> <arg> has to be replaced by the output directory path.
de: -D --dir <arg> <arg> muss durch den Ausgabeverzeichnispfad ersetzt werden.

source: -B --databases <args> <args> has to be replaced by the SQLite3 databases which should be added to the output.
de: -B --databases <args> <args> muss durch die SQLite3-Datenbanken, welche zur Ausgabe hinzugefügt werden, ersetzt werden.

source: Several arguments has to be separated by using the : character.
de: Mehrere Argumente müssen durch die Verwendung des :-Zeichens getrennt werden.

source: Report bugs to tamino@cdauth.de or on http://sourceforge.net/projects/vjasssdk/
de: Melden Sie Fehler an tamino@cdauth.de oder unter http://sourceforge.net/projects/vjasssdk/

source: Import directory path "%s" has already been added to list.
de: Importverzeichnispfad "%s" wurde bereits zur Liste hinzugefügt.

source: Database "%s" has already been added to list.
de: Datenbank "%s" wurde bereits zur Liste hinzugefügt.

source: Objects of list %d already won't be parsed.
de: Objekte der Liste %d werden bereits nicht geparst werden.

source: File path "%s" has already been added to list.
de: Dateipfad "%s" wurde bereits zur Liste hinzugefügt.

source: Missing file arguments.
de: Datei-Argumente fehlen.

source: Warning: Although there won't be created any HTML files you have used the --pages option.
de: Warnung: Obwohl keine HTML-Dateien erzeugt werden, haben Sie die --pages-Option verwendet.

source: vJass API Documentation
de: vJass-API-Dokumentation

source: Brief Description
de: Kurzbeschreibung

source: Object
de: Objekt

source: Authors
de: Autoren

source: See Objects
de: Nachsehobjekte

source: Todos
de: Zu tun

source: Text Macro
de: Textmakro

source: Yes
de: Ja

source: No
de: Nein
