Repository: xiangzhai/vjasssdk
Catalog: pjass/locale/*/LC_MESSAGES/pjass.po
Languages: de

source: Major error!
de: Bedeutender Fehler!

source: Undeclared function: %s
de: Undeklarierte Funktion: %s

source: Undeclared variable: %s
de: Undeklarierte Variable: %s

source: Symbol %s multiply defined.
de: Symbol %s mehrmals definiert.

source: Bad types for binary operator.
de: Schlechte Typen für den Binär-Operator.

source: Cannot convert %s to %s.
de: Kann %s nicht zu %s konvertieren.

source: Cannot convert %s to %s
de: Kann %s nicht zu %s konvertieren

source: Too many arguments passed to function.
de: Es wurden zu viele Argumente an die Funktion übergeben.

source: Not enough arguments passed to function.
de: Es wurden nicht genügend Argumente an die Funktion übergeben.

source: Cannot be converted to numeric type.
de: Kann nicht zu einem numerischen Typ konvertiert werden.

source: Comparing the order/size of 2 variables only works on Reals and Integers.
de: Das Vergleichen der Anweisung/Größe zweier Variable funktioniert nur bei Fließkomma- und Ganzzahlen.

source: null > null and similar is not allowed.
de: null > null und Ähnliches ist nicht erlaubt.

source: Comparing two variables of different primitive types (except real and integer) is not allowed.
de: Das Vergleichen zweier Variablen unterschiedlicher primitiver Typen (ausgenommen real und integer) ist nicht erlaubt.

source: Parse successful: %8d lines: %s.
de: Syntaxüberprüfung war erfolgreich: %8d Zeilen: %s.

source: %s failed with %d error%s.
de: %s mit %dFehler%s fehlgeschlagen .

source: pjass version %s by Rudi Cilibrasi, modified by AIAndy and Baradé.
de: pjass Version %s von Rudi Cilibrasi, verändert von AIAndy und Baradé.

source: To use this program, list the files you would like to parse in order. If you would like to parse from standard input (the keyboard), then use - as an argument. If you supply no arguments to pjass, it will parse the console standard input by default. To test this program, go into your Scripts directory, and type: pjass common.j common.ai Blizzard.j pjass accepts some options: pjass --help Display this help pjass --version Display version information and exit pjass -e1 Ignores error level 1pjass +e2 Undo Ignore of error level 2pjass - Read from standard input (may appear in a list)
de: Um dieses Programm zu benutzen, müssen Sie die zu parsenden Dateien in Reihenfolge auflisten.

source: Error: Cannot open %s.
de: Fehler: Kann %s nicht öffnen.

source: Got result %d, %s.
de: Ergebnis %d, %s erhalten.

source: %d errors ignored.
de: %d Fehler wurden ignoriert.

source: Parse failed: 1 error total.
de: Syntaxüberprüfung fehlgeschlagen: Insgesamt 1 Fehler.

source: Parse failed: %d errors total.
de: Syntaxüberprüfung fehlgeschlagen: Insgesamt %d Fehler.

source: Parse failed.
de: Syntaxüberprüfung fehlgeschlagen.
